
module.exports = {
    CHAT: {
        //JC_XIANE:"接受总额 ",
        DAY_0:"ថ្ងៃអាទិត្យ",
        DAY_1:"ថ្ងៃច័ន្ទ",
        DAY_2:"ថ្ងៃអង្គារ",
        DAY_3:"ថ្ងៃពុធ",
        DAY_4:"ថ្ងៃព្រហស្បតិ៍",
        DAY_5:"ថ្ងៃសុក្រ",
        DAY_6:"ថ្ងៃសៅរ៍",
        YESTERDAY:"ម្សិលមិញ",
        BARRAGE_TEXT:"បាញ់គ្រាប់បែក",
        IN_PUT_TEXT:"សូមបញ្ចូលអកសរ",
        RECORD_TEXT:"កំណត់ត្រាការជជែក",
        BARRAGE_TYPE_1:"គ្រាប់បែកធម្មតា",
        BARRAGE_TYPE_2:"គ្រាប់បែកទំនើប",
        BARRAGE_TYPE_3:"គ្រាប់បែកចម្រុះពណ៌",
        GOLD_FAIL:"កាក់មាស់មិនគ្រប់គ្រាន់",
        ERROR:"ប្រតិបត្តិការបានបរាជ័យ",
        RECORD_TIPS:"អូសឡើងលើដើម្បីបោះបង់ការផ្ញើ",
        CHAT_TIPS:"[XX]សារថ្មី។",
        EMOTE_TEXT:"កន្សោម",
        RECORD_FAIL_WEB:"កម្មវិធីរុករកមិនគាំទ្រការថតសំឡេងទេ។!",
        AUDIO_TIPS:"ផ្ញើ សារ សំឡេង",
        MESSAGE_TIPS:"សូមរង់ចាំ [XX] វិនាទីមុនពេលផ្ញើ",
    },

    CHAT_BARRAGE_LIST:{
        0:"ចុះទៅ កង់ក្លាយជាម៉ូតូ",
        1:"ព្រះជាអ្នកសាប់បៀ ហើយអ្នកលេងគឺជាខ្ញុំ",
        2:"រឿងនិទានដែលខ្ញុំសរសេរទាំងទឹកភ្នែកក៏ត្រូវដែរបញ្ចប់",
        3:"ការអត់ធ្មត់គឺសម្រាប់ All-in នៃដៃបន្ទាប់",
        4:"សំណាងគឺមានល្អនិងអាក្រក់, កម្លាំងដែលអមដំណើរជីវិតពិត",
        5:"ធ្លាក់ខ្យល់ដូចមកថ្ងៃខែ ក្នុងមួយខែមានតែប៉ុន្នានថ្ងៃនឹងទេ",
    },
    
}