// //console.log("zh_login")
module.exports = {
    ltest3: {
        test: "测试3"
    },
    LOGIN: {
        ONLOGINING: "正在登录，请稍候",
        ONREGISTING: "正在注册，请稍候",
        REQUESTDATA: "កំពុងស្នើសុំទិន្នន័យ សូមរង់ចាំ",
        REQUESTTIMEOUT: "ការស្នើរទិន្នន័យអស់ពេលហើយ។",
        REPEATLOGON: "账号重复登录，您将被强制下线",
        JUMPTOGAME: "正在跳转游戏中",
        RECONNECTTEXT: "断线重连测试中",
        LOGINFAIL:"登录失败，请检查网络并重试！",
        AUTO_LOGIN:"  自动登录中……\n点击屏幕取消自动登录",
        ACCOUNT:"用户名",
        PASSWORD:"密码",
        ACCOUNT_REG:"សូមបញ្ចូលគណនី",
        PASSWORD_REG:"សូមបញ្ចូលពាក្យសម្ងាត់",
        INVITECODE_REG: "សូមបញ្ចូលលេខកូដអញ្ជើញ",
        LOGIN: "ធ្វើការចូល",
        REGISTER: "បង្កើតគណនី",
        LOGIN_ACCOUNT: "ធ្វើការចូលគណនី",
        FORGET_PASSWORD: "ភ្លេច​លេខសំងាត់​",
        CREATE_ACCOUNT: "បង្កើត​គណនី",
        LOGIN_PROTOCOL: "<color=#a39eb8>ធ្វើការចូលមានន័យថាអ្នកយល់ព្រម</c><color=#e2c7a2 click=\"onClickUserProtol\"> 《កិច្ចព្រមព្រៀងអ្នកប្រើប្រាស់》</c><color=#a39eb8> <br/>នឹង </c><color=#e2c7a2 click=\"onClickPrivacyProtol\">《កិច្ចព្រមព្រៀងភាពឯកជន》</c></color>"

    },
    LOGIN_ERROR:{
        1:"ចូលបានជោគជ័យ",
        2: "សុំអភ័យទោស លេខកូដម៉ាស៊ីនមិនត្រឹមត្រូវ ហើយមិនអាចចូលបានទេ!",
        3: "សុំអភ័យទោសប្រព័ន្ធបានបិទមុខងារចូលគណនីរបស់អ្នក សូមទាក់ទងផ្នែកសេវាកម្មអតិថិជនសម្រាប់ព័ត៌មានលម្អិត!",
        5: "គណនីរបស់អ្នកមិនមានទេ សូមព្យាយាមចូលម្តងទៀត!",
        6: "ពាក្យសម្ងាត់របស់អ្នកមិនត្រឹមត្រូវទេ សូមពិនិត្យមើលឡើងវិញ ហើយព្យាយាមចូលម្តងទៀត!",
        10: "ប្រវែងឈ្មោះគណនីគឺពី 6-20 តួអក្សរ!",
        11: "ពាក្យ​សម្ងាត់​មាន​ប្រវែង 6-20 តួអក្សរ!",
        12: "សញ្ញាសម្ងាត់មិនត្រឹមត្រូវទេ សូមចូលម្តងទៀត",
        17: "ហ្គេមនេះមិនបើកសម្រាប់អ្នកប្រើប្រាស់ក្នុងស្រុកជាបណ្តោះអាសន្ន សូមអភ័យទោសផង!",
        21: "ឆានែលមានកំហុស ការចូលបានបរាជ័យ",
    },
    REGISTER_ERROR:{
        1: "ចូលបានជោគជ័យ",
        2: "យើងខ្ញុំសូមអភ័យទោសក្នុងការជូនដំណឹងដល់អ្នកថាមុខងារចុះឈ្មោះអាសយដ្ឋាន IP របស់អ្នកត្រូវបានបិទដោយប្រព័ន្ធ សូមទាក់ទងផ្នែកសេវាកម្មអតិថិជនសម្រាប់ព័ត៌មានលម្អិត",
        3: "សូមអភ័យទោសក្នុងការជូនដំណឹងដល់អ្នកថាប្រព័ន្ធបានបិទមុខងារចុះឈ្មោះម៉ាស៊ីនរបស់អ្នក សូមទាក់ទងផ្នែកសេវាកម្មអតិថិជនសម្រាប់ព័ត៌មានលម្អិត!",
        4: "គណនីនេះត្រូវបានចុះឈ្មោះរួចហើយ សូមសាកល្បងគណនីផ្សេងទៀតដើម្បីចុះឈ្មោះម្តងទៀត",
        5: "ការចុះឈ្មោះគណនីបានបរាជ័យដោយសារហេតុផលដែលមិននឹកស្មានដល់ សូមព្យាយាមចុះឈ្មោះម្តងទៀត!",
        6: "ពាក្យសម្ងាត់របស់អ្នកមិនត្រឹមត្រូវទេ សូមពិនិត្យមើលឡើងវិញ ហើយព្យាយាមចូលម្តងទៀត!",
        7: "សូមអភ័យទោស លេខកូដម៉ាស៊ីនមិនមានហើយមិនអាចចុះឈ្មោះបានទេ!",
        10: "ប្រវែងឈ្មោះគណនីគឺពី 6-20 តួអក្សរ!",
        11: "ពាក្យ​សម្ងាត់​មាន​ប្រវែង 6-20 តួអក្សរ!",
        12: "លេខគណនីមានជាភាសាអង់គ្លេស និងលេខ!",
        13: "សូមបញ្ចូលលេខកូដណែនាំឱ្យបានត្រឹមត្រូវ!",
        17: "ហ្គេមនេះមិនបើកសម្រាប់អ្នកប្រើប្រាស់ក្នុងស្រុកជាបណ្តោះអាសន្ន សូមអភ័យទោសផង!",
        20: "កំហុសលេខកូដផ្ទៀងផ្ទាត់ ការចុះឈ្មោះបានបរាជ័យ!",
    },
    LOGIN_TIPS:{
        1:"ប្រវែងគណនីឬលេខសម្ងាត់គឺ 6-20 តួអក្សរ!",
        2:"លេខគណនី ឬលេខសម្ងាត់មិនអាចទទេបានទេ!",
        3:"លេខគណនីមានជាភាសាអង់គ្លេស និងលេខ!",
        4:"គណនី ឬ​ពាក្យ​សម្ងាត់​មិន​អាច​មាន​ដកឃ្លា​ទេ!",
        5:"លេខគណនី ឬពាក្យសម្ងាត់មិនអាចមានសញ្ញា!",
        6:"ពាក្យ​សម្ងាត់​ដែល​បាន​បញ្ចូល​ពីរ​ដង​មិន​ត្រូវ​គ្នា!",
        7:"ពាក្យសម្ងាត់មិនអាចមានតួអក្សរខុសច្បាប់!",
    },
    NETWORKS_ERROR:{
        
    },
    LOGIN_IMAGE_PNG_NAME:{

    },

}