// //console.log("zh_login")
module.exports = {
    ltest3: {
        test: "测试3"
    },
    LOGIN: {
        ONLOGINING: "正在登录，请稍候",
        ONREGISTING: "正在注册，请稍候",
        REQUESTDATA: "正在请求数据，请稍候",
        REQUESTTIMEOUT: "请求数据超时",
        REPEATLOGON: "账号重复登录，您将被强制下线",
        JUMPTOGAME: "正在跳转游戏中",
        RECONNECTTEXT: "断线重连测试中",
        LOGINFAIL:"登录失败，请检查网络并重试！",
        AUTO_LOGIN:"  自动登录中……\n点击屏幕取消自动登录",
        ACCOUNT:"用户名",
        PASSWORD:"密码",
        ACCOUNT_REG:"请输入账号",
        PASSWORD_REG:"请输入密码",
        INVITECODE_REG: "请输入邀请码",
        LOGIN: "登录",
        REGISTER: "注册账号",
        LOGIN_ACCOUNT: "登录账号",
        FORGET_PASSWORD: "忘记密码",
        CREATE_ACCOUNT: "创建账号",
        LOGIN_PROTOCOL: "<color=#a39eb8>登录即代表您同意</c><color=#e2c7a2 click=\"onClickUserProtol\"> 《用户协议》</c><color=#a39eb8> 和 </c><color=#e2c7a2 click=\"onClickPrivacyProtol\">《隐私协议》</c></color>"

    },
    LOGIN_ERROR:{
        1:"登录成功",
        2: "抱歉地通知您，机器码不存在,不能登录!",
        3: "抱歉地通知您，系统禁止了您登录功能，请联系客户服务中心了解详细情况！",
        5: "您的帐号不存在，请再次尝试登录！",
        6: "您的密码输入有误，请查证后再次尝试登录！",
        10: "账号长度为6-20个字符！",
        11: "密码长度为6-20个字符！",
        12: "令牌失效,请从平台重新登录！",
        17: "游戏暂不对国内用户开放，请见谅！",
        21: "渠道错误，登录失败",
    },
    REGISTER_ERROR:{
        1: "登录成功",
        2: "抱歉地通知您，系统禁止了您所在的 IP 地址的注册功能，请联系客户服务中心了解详细情况",
        3: "抱歉地通知您，系统禁止了您的机器的注册功能，请联系客户服务中心了解详细情况！",
        4: "此帐号已被注册，请换另一帐号尝试再次注册",
        5: "由于意外的原因，帐号注册失败，请尝试再次注册！",
        6: "您的密码输入有误，请查证后再次尝试登录！",
        7: "抱歉地通知您，机器码不存在,不能注册!",
        10: "账号长度为6-20个字符！",
        11: "密码长度为6-20个字符！",
        12: "账号由英文和数字组成！",
        13: "请输入正确的推广码！",
        17: "游戏暂不对国内用户开放，请见谅！",
        20: "验证码错误，注册失败！",
    },
    LOGIN_TIPS:{
        1:"账号或密码长度为6-20个字符！",
        2:"账号或密码不能为空！",
        3:"账号由英文和数字组成！",
        4:"账号或密码不能含有空格！",
        5:"账号或密码不能含有表情！",
        6:"两次输入的密码不一致！",
        7:"密码不能包含非法字符！",
    },
    NETWORKS_ERROR:{
        
    },
    LOGIN_IMAGE_PNG_NAME:{

    },

}