// //console.log("zh_login")
module.exports = {
    ltest3: {
        test: "测试3"
    },
    LOGIN: {
        ONLOGINING: "正在登錄，請稍候",
        ONREGISTING: "正在註冊，請稍候",
        REQUESTDATA: "正在請求數據，請稍候",
        REQUESTTIMEOUT: "請求數據超時",
        REPEATLOGON: "賬號重複登錄，您將被強制下線",
        JUMPTOGAME: "正在跳轉遊戲中",
        RECONNECTTEXT: "斷線重連測試中",
        LOGINFAIL:"登錄失敗，請檢查網絡並重試！",
        AUTO_LOGIN:"  自動登錄中……\n點擊屏幕取消自動登錄",
        ACCOUNT:"用戶名",
        PASSWORD:"密碼",
        ACCOUNT_REG:"請輸入賬號",
        PASSWORD_REG:"請輸入密碼",
        INVITECODE_REG: "請輸入邀請碼",
        LOGIN: "登錄",
        REGISTER: "註冊賬號",
        LOGIN_ACCOUNT: "登錄賬號",
        FORGET_PASSWORD: "忘記密碼",
        CREATE_ACCOUNT: "創建賬號",
        LOGIN_PROTOCOL: "<color=#a39eb8>登錄即代表您同意</c><color=#e2c7a2 click=\"onClickUserProtol\"> 《使用者協定》</c><color=#a39eb8> 和 </c><color=#e2c7a2 click=\"onClickPrivacyProtol\">《隱私協定》</c></color>"
    },
    LOGIN_ERROR:{
        1:"登錄成功",
        2: "抱歉地通知您，機器碼不存在,不能登錄!",
        3: "抱歉地通知您，系統禁止了您登錄功能，請聯系客戶服務中心了解詳細情況！",
        5: "您的賬號不存在，請再次嘗試登錄！",
        6: "您的密碼輸入有誤，請查證後再次嘗試登錄！",
        10: "賬號長度為6-20個字符！",
        11: "密碼長度為6-20個字符！",
        12: "令牌失效,請從平台重新登錄！",
        17: "遊戲暫不對國內用戶開放，請見諒！",
        21: "渠道錯誤，登錄失敗",
    },
    REGISTER_ERROR:{
        1: "登錄成功",
        2: "抱歉地通知您，系統禁止了您所在的 IP 地址的註冊功能，請聯系客戶服務中心了解詳細情況",
        3: "抱歉地通知您，系統禁止了您的機器的註冊功能，請聯系客戶服務中心了解詳細情況！",
        4: "此賬號已被註冊，請換另一賬號嘗試再次註冊",
        5: "由於意外的原因，賬號註冊失敗，請嘗試再次註冊！",
        6: "您的密碼輸入有誤，請查證後再次嘗試登錄！",
        7: "抱歉地通知您，機器碼不存在,不能註冊!",
        10: "賬號長度為6-20個字符！",
        11: "密碼長度為6-20個字符！",
        12: "賬號由英文和數字組成！",
        13: "請輸入正確的推廣碼！",
        17: "遊戲暫不對國內用戶開放，請見諒！",
        20: "驗證碼錯誤，註冊失敗！",
    },
    LOGIN_TIPS:{
        1:"賬號或密碼長度為6-20個字符！",
        2:"賬號或密碼不能為空！",
        3:"賬號由英文和數字組成！",
        4:"賬號或密碼不能含有空格！",
        5:"賬號或密碼不能含有表情！",
        6:"兩次輸入的密碼不一致！",
        7:"密碼不能包含非法字符！",
    },
    NETWORKS_ERROR:{
        
    },
    LOGIN_IMAGE_PNG_NAME:{

    },

}